## Terraform data for `apps` stack
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Show Validation</summary>

```
Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
module.s42.random_password.meilisearch_token: Refreshing state... [id=none]
module.s42.random_password.next_auth_secret: Refreshing state... [id=none]
module.s42.random_password.postgres: Refreshing state... [id=none]
module.s42.module.istio.kubectl_manifest.virtual_services["app-s42"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/production/virtualservices/app-s42]
module.s42.module.meilisearch.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/meilisearch-data]
module.s42.module.postgres.kubernetes_config_map.app["config"]: Refreshing state... [id=production/postgres-config]
module.s42.module.postgres.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/postgres-data]
module.s42.module.postgres.kubernetes_service.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.meilisearch.kubernetes_service.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.interface.kubernetes_service.app[0]: Refreshing state... [id=production/interface]
module.s42.module.api.kubernetes_service.app[0]: Refreshing state... [id=production/api]
module.webhooked.module.webhooked.kubernetes_service.app[0]: Refreshing state... [id=production/webhooked]
module.webhooked.module.webhooked.kubernetes_config_map.app["config"]: Refreshing state... [id=production/webhooked-config]
module.s42.module.jwtks_service.kubernetes_service.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.kubernetes_config_map.stud42_config: Refreshing state... [id=production/stud42-config]
module.s42.kubernetes_secret.next_auth_secret: Refreshing state... [id=production/next-auth-secret]
module.s42.module.crawler_campus.kubernetes_cron_job.app[0]: Refreshing state... [id=production/crawler-campus]
module.s42.module.webhooks_processor.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.interface.kubernetes_deployment.app[0]: Refreshing state... [id=production/interface]
module.s42.module.api.kubernetes_deployment.app[0]: Refreshing state... [id=production/api]
module.s42.module.jwtks_service.kubernetes_deployment.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.module.meilisearch_clean_tasks.kubernetes_cron_job.app[0]: Refreshing state... [id=production/meilisearch-clean-tasks]
module.s42.module.crawler_locations.kubernetes_cron_job.app[0]: Refreshing state... [id=production/crawler-locations]
module.s42.module.meilisearch.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.jwtks_service.kubernetes_manifest.certificate["grpc-internal"]: Refreshing state...
module.s42.module.postgres.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.meilisearch.kubernetes_secret.app["token"]: Refreshing state... [id=production/meilisearch-token]
module.webhooked.module.secrets.kubernetes_manifest.sealed_secret["s42-webhooked-secrets"]: Refreshing state...
module.s42.module.postgres.kubernetes_secret.app["credentials"]: Refreshing state... [id=production/postgres-credentials]
module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/interface]
module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/api]
module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.jwtks_service.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.kubernetes_manifest.rabbitmq: Refreshing state...
module.webhooked.module.webhooked.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooked]
module.webhooked.module.webhooked.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooked]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["s42-service-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["oauth2-providers"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["jwtks-service-certs-jwk"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["github-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["discord-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["sentry-dsns"]: Refreshing state...
module.s42.kubernetes_pod_disruption_budget.rabbitmq: Refreshing state... [id=production/rabbitmq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s42.module.api.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/api"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.1" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "api"
                        # (8 unchanged attributes hidden)

                        # (16 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/api"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.api.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/api"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.crawler_campus.kubernetes_cron_job.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job" "app" {
        id = "production/crawler-campus"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-campus"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
                      ~ "version"                      = "v0.22.1" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.22.1" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (11 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.22.1" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-campus"
                                # (8 unchanged attributes hidden)

                                # (12 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.crawler_locations.kubernetes_cron_job.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job" "app" {
        id = "production/crawler-locations"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-locations"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
                      ~ "version"                      = "v0.22.1" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.22.1" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (11 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.22.1" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-locations"
                                # (8 unchanged attributes hidden)

                                # (14 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.interface.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/interface"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.1" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "interface"
                        # (8 unchanged attributes hidden)

                        # (19 unchanged blocks hidden)
                    }

                    # (4 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/interface"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.interface.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/interface"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.jwtks_service.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/jwtks-service"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.1" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "jwtks-service"
                        # (8 unchanged attributes hidden)

                        # (10 unchanged blocks hidden)
                    }

                    # (5 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.jwtks_service.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/jwtks-service"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.jwtks_service.kubernetes_manifest.certificate["grpc-internal"] will be updated in-place
  ~ resource "kubernetes_manifest" "certificate" {
      ~ manifest = {
          ~ metadata   = {
              ~ labels    = {
                  ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
                  ~ version                        = "v0.22.1" -> "latest"
                    # (5 unchanged elements hidden)
                }
                name      = "jwtks-service-grpc-internal"
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ labels                     = {
                  - "app"                          = "jwtks-service"
                  - "app.kubernetes.io/created-by" = "github-actions"
                  - "app.kubernetes.io/managed-by" = "terraform"
                  - "app.kubernetes.io/part-of"    = "jwtks-service"
                  - "app.kubernetes.io/version"    = "v0.22.1"
                  - "kubernetes.io/name"           = "jwtks-service"
                  - "version"                      = "v0.22.1"
                } -> (known after apply)
                name                       = "jwtks-service-grpc-internal"
                # (14 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

  # module.s42.module.jwtks_service.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/jwtks-service"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.webhooks_processor.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/webhooks-processor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          ~ replicas                  = "10" -> "1"
            # (4 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.1" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "webhooks-processor"
                        # (8 unchanged attributes hidden)

                        # (20 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/webhooks-processor"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.1" -> "latest"
              ~ "version"                      = "v0.22.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.webhooked.module.secrets.kubernetes_manifest.sealed_secret["s42-webhooked-secrets"] must be replaced
-/+ resource "kubernetes_manifest" "sealed_secret" {
      ~ manifest = {
          ~ spec       = {
              ~ encryptedData = { # forces replacement
                  ~ "GITHUB_WEBHOOK_SECRET" = "AgAlVdqq8lH5K32i8MkN04M/rG1YkgDU0zcDGgJjHd/o8OfuYhCNRbUvi/xN5jbSL39k5tJVWMuGW0SV+nvM5KyGAProoHkLL1ltnV9lcvSxhfxY5N8TbKLZmn9iWIpMayucYPUHUi2zyv+D8D9IR2GzgtbZLa/f0OKqLwkebxnd4rCMwOVwn6ZV1SFUnwOnYMSs8X8vISWK8YD2qmE+lo/CNbixoW9qw1t4PbqMiV6ZJsbA+xr5niqAEgEhFLEsZC0VHmvRJulfkJg99+OTKzUcSJ1saMdCi95pyU54pnAOvHbApxfZigxrXC1UE+MoxShnuIzRErcsvo5+FUPZkubKshBha+OwAKjCF3jUsdmkG30V0cWswVSoxejTf5WVOw75C7Kas+HddJaq4JLqT8KZyWKNvkiDTTvOO5QL7jm26a0zGvJ6sR/4py3TdcrF7XCdGv3ysRRdcQ2Kk0e2z2Gn3ZA/67m9RDLU1CyGxEZcU7LTEYQQyGI+GkWQNjqka//AdM+i1J5f68hSIzrrKna/GGOlRCYVmfwVypDOKIc8x5bZf087+36cvqMuiVqPaoyRBhA0jjHOEiq9gI7S0QRhTA1fbT5ddQdnYW+zcXvcMzQ4H2XGPszXzmUh6hD4g4UAcweWEjKRulebG1IIgYbiZ9tJGwmwUEObWX1QZ4r9BxZCzwE/x+o/pNe6K2Mi+i+uOfBq6sEzGlULo4uFvrGrtP/0ZBTLP+hAvTXl1ETMGxnA/fYJokrkyrDkh4Udy64Bgge3004wHA==" -> "AgBR/xT5WFSNIUYWI/ed3HQP3DaHc7kFED+HvELXOTUaEs2h2nmy5fJCFLk5RbDhNHpXB3jGCzEg6CEal2bjDpHAhNzrfNYP78P10SKixzAam8Ne26aFOgvR1okkLdvmqjiFyFajJW76ArZHF+vaeOrm17ZrLw3qkxPNUAM6mAH6NOD4N2vlS7zyPqY8rPM1U8ko+wgzDtYTQXHpshY4eWI/RAMyZT8hSTElMRoy8cNIdrNkXQKMCU77hOkQIWCwqX1gVXgLesJjmMEnfopcXT1gdP5GU+3b0drAwTja/j6KoMfKxxmlFFyn8B05rE9nHvZHYznPM+/wXbhjCOwA+z8wDsvfetQz9fY+FK635kCPVrwIzf+gEz7FKfsLYKdDVeV2RcB/L8chNz1AQRDQLw753rFFXnJKJc++jORjI8rC3sF//Zc5QjFbsMKv5kysYOhqObRGTidYmuVY5KEu3eWuSxaFZ6q4RiOStJp7pCSfUxX/X8OJs1rE0kCpFrXgI2icBl3YvEW9RlIRDhfxtpvNQfU1vVx0G160h5AwA5dOa5+rHgKhjU2HlaqwgAAeyrVctvqqp+mfVTG6C19nOVZBRRu//xINTp6MoZ8Fd+/fTN5IL3+r5OvhGRHSj546YQSW+Iv5XHbV0Uqv/QctrGwMGqkjbdz2dk/shfTCjBRd8SrOwjxnvcuGaaQsdMLsb3FmbGBX6SgGRaw+Jlw1stLvGmXOOHOY+Zul8yngz8hyGabnYvkvhQvfGL+LRheTM3lzHfR/EyOH9Q=="
                  ~ "WEBHOOK_SECRET_HEADER" = "AgBhsG3UFpoUs6wiZy8NE0cyMVygX99hQ57VSp3nkCBHWfQJFZQv1NnkpBjLzNcT9Br1w4kcr9S5vYc/19jDsDnonpACxLgY2q6LTEJ+bdl+EhUg0Tb9+/VFTmHbTbEAWWtIhBqc/sMUOOyJ7/G2pqP0MPEQ9bvFtt0+2V98Wq1Vyj2uMVbQYT6QvXwiBMmKN3jtKL8mcr0LSb6PK2poV+EWQQIbPpEUOinq7igPS7RbgPoGfapaf9TsRSEOT29j9k8YiXiqO5CYDz67UTSdP7kq6TENV+cHb06K4eGbFWdJFTLRBN5A0p4XXm9t3GDC1bSufy6Y1shxwVLJkLiKY1NF9rxD9jOCnn3QmT78DUGBFC2JJekm+wvN/s0scSQ81G3tlZW26ftxb6CyChTze+ovpBAP7L+oZXuwVYasQS0kqPPQvSvn5T5f3wP3asQOxqq3SOnWUm9vXURxSeRQBVSSIzqqpnRvrY48L6mvc2n3nLJAc0Mom+YRY9IDOOxtpejc6sdd+9U8BAEKPCG6uFxXwYxle9kBUIiEB9mQgn0pAssOF/vXngP1R7XCPrRauaCQ2IKbdXCYfny1csc9ajUHVJrOszww1VjYzTuEVzWhW9kMTjZEgHARG0/S/FusgJfHRY6zT+smfvhFUzigh1o4s1AtC1lKYjX90CkbbACkBhlt/7n/yai4OKw+Mj01rx+1n2MZml7HIcbj67BybXS3SXHXq9LW7oRnyXnnVLq9N2c46wTFeCuV/WADeyPVO7vsRmkxn+4dbqwED1AjRkXTuDvAi0paLQbyII7H0ghyHAARY25GW+TUGXNE1+GBU5CUlbWA1d97BEdoW5bGOTzeO2E+Ktqt2/y4hmCe+uhqaBIIRr50HhieKIhDu/MlwypRbHDxno6VAgvh7wtIGsCLqHEEJQ==" -> "AgCV5tq4sISxnhu4gTB0V+hO06iOIXWY/93COj+V+F2rKjyUb8j6ktbsVibbGJ+KvHTo02UWJ5Qv9NtlZ7zFKm0HCrKKTORixKK3QTAJdk6pxIUYfHdGsDozcDU9ozF/2Xy3DuHEad20m1G1UCb9ICtkar07Q64jH/1P5L+xhA0RwdwW/zOQe5IxHV/2daf0oi4xJIaM0kLvhpe/PFIqViTm9fExpo5AlA5XqjrSNspoNfH6maX5OO9ShawyzKXEFMFLWJdtbV8JMh6nu/h3uVFKzWiH5rK3GbqVzNozZdjGzqA3iqPNZ5U7pBP5DX0qW65zuGLV28ZUWmZTTBpWed22FLn6+VLu3FDw7GSaXCIen0R3zr6WZ99SmBY/yBNJDphtJgrIWLX9W+VDGms9LOemXXToao4AxqBzdHCDu1kH+zV8BjFW8rKHCGsKcZhU3LxVVvf5Q0xUf6jhTqekVz1c58/ifmO/4QVm1uifPL3PBbdMYo1BzU8FZpieoPerzbw1TQR5yElTQY9Miphiht2vJhTXpIdIvvK3ByTaW6aZ1wACx6WSHj7hJrB5pLz6S2f7XeB0VwPeAtThwpovXRfrTr17sRmGGQ+M+LjHQbC3dZpq/JQWiNrZ8ufvBvJhyV1qUjf5ZTDQrsU0POdFqdwIkdtSbPOHdG2XaE0ODGNKy1TZb4aW73EX/LlXhzqpjA9/0mTyMMjJVkPkNij8by0Gr0VUVsv47+NtNHTV01VYNTAo/sO5JbYI3KBVw2K0kNemNHyKIwBn2lfzcCspeECUHL7/7jmt7o0Qg4WoKdRHFbzgEi0jW1Q9TPbkOMWPZj1gF2qTH5WK2NAeNDWtSvQBJyaoWkmsS7fpkzxs54OuYfUxtOdoyjadpLJDaar5WMkLWGGIf7XCY9zdSsRhIO0F90pRaOsfFelo6TRck9IhszQY20w6wj6T/YYTsslxJ8MJuhjmRyfEPSuJud6BtyYwyiFTV6kbwtxuBQbD09ocEPYhWOBEA74Hrki9X7g3hBaKT6m2wVKoa4fv0jXThp1sbYVq2xXKpA=="
                }
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                } -> (known after apply)
              ~ clusterName                = null -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "s42-webhooked-secrets"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ data          = null -> (known after apply)
              ~ encryptedData = {
                  ~ "GITHUB_WEBHOOK_SECRET" = "AgAlVdqq8lH5K32i8MkN04M/rG1YkgDU0zcDGgJjHd/o8OfuYhCNRbUvi/xN5jbSL39k5tJVWMuGW0SV+nvM5KyGAProoHkLL1ltnV9lcvSxhfxY5N8TbKLZmn9iWIpMayucYPUHUi2zyv+D8D9IR2GzgtbZLa/f0OKqLwkebxnd4rCMwOVwn6ZV1SFUnwOnYMSs8X8vISWK8YD2qmE+lo/CNbixoW9qw1t4PbqMiV6ZJsbA+xr5niqAEgEhFLEsZC0VHmvRJulfkJg99+OTKzUcSJ1saMdCi95pyU54pnAOvHbApxfZigxrXC1UE+MoxShnuIzRErcsvo5+FUPZkubKshBha+OwAKjCF3jUsdmkG30V0cWswVSoxejTf5WVOw75C7Kas+HddJaq4JLqT8KZyWKNvkiDTTvOO5QL7jm26a0zGvJ6sR/4py3TdcrF7XCdGv3ysRRdcQ2Kk0e2z2Gn3ZA/67m9RDLU1CyGxEZcU7LTEYQQyGI+GkWQNjqka//AdM+i1J5f68hSIzrrKna/GGOlRCYVmfwVypDOKIc8x5bZf087+36cvqMuiVqPaoyRBhA0jjHOEiq9gI7S0QRhTA1fbT5ddQdnYW+zcXvcMzQ4H2XGPszXzmUh6hD4g4UAcweWEjKRulebG1IIgYbiZ9tJGwmwUEObWX1QZ4r9BxZCzwE/x+o/pNe6K2Mi+i+uOfBq6sEzGlULo4uFvrGrtP/0ZBTLP+hAvTXl1ETMGxnA/fYJokrkyrDkh4Udy64Bgge3004wHA==" -> "AgBR/xT5WFSNIUYWI/ed3HQP3DaHc7kFED+HvELXOTUaEs2h2nmy5fJCFLk5RbDhNHpXB3jGCzEg6CEal2bjDpHAhNzrfNYP78P10SKixzAam8Ne26aFOgvR1okkLdvmqjiFyFajJW76ArZHF+vaeOrm17ZrLw3qkxPNUAM6mAH6NOD4N2vlS7zyPqY8rPM1U8ko+wgzDtYTQXHpshY4eWI/RAMyZT8hSTElMRoy8cNIdrNkXQKMCU77hOkQIWCwqX1gVXgLesJjmMEnfopcXT1gdP5GU+3b0drAwTja/j6KoMfKxxmlFFyn8B05rE9nHvZHYznPM+/wXbhjCOwA+z8wDsvfetQz9fY+FK635kCPVrwIzf+gEz7FKfsLYKdDVeV2RcB/L8chNz1AQRDQLw753rFFXnJKJc++jORjI8rC3sF//Zc5QjFbsMKv5kysYOhqObRGTidYmuVY5KEu3eWuSxaFZ6q4RiOStJp7pCSfUxX/X8OJs1rE0kCpFrXgI2icBl3YvEW9RlIRDhfxtpvNQfU1vVx0G160h5AwA5dOa5+rHgKhjU2HlaqwgAAeyrVctvqqp+mfVTG6C19nOVZBRRu//xINTp6MoZ8Fd+/fTN5IL3+r5OvhGRHSj546YQSW+Iv5XHbV0Uqv/QctrGwMGqkjbdz2dk/shfTCjBRd8SrOwjxnvcuGaaQsdMLsb3FmbGBX6SgGRaw+Jlw1stLvGmXOOHOY+Zul8yngz8hyGabnYvkvhQvfGL+LRheTM3lzHfR/EyOH9Q=="
                  ~ "WEBHOOK_SECRET_HEADER" = "AgBhsG3UFpoUs6wiZy8NE0cyMVygX99hQ57VSp3nkCBHWfQJFZQv1NnkpBjLzNcT9Br1w4kcr9S5vYc/19jDsDnonpACxLgY2q6LTEJ+bdl+EhUg0Tb9+/VFTmHbTbEAWWtIhBqc/sMUOOyJ7/G2pqP0MPEQ9bvFtt0+2V98Wq1Vyj2uMVbQYT6QvXwiBMmKN3jtKL8mcr0LSb6PK2poV+EWQQIbPpEUOinq7igPS7RbgPoGfapaf9TsRSEOT29j9k8YiXiqO5CYDz67UTSdP7kq6TENV+cHb06K4eGbFWdJFTLRBN5A0p4XXm9t3GDC1bSufy6Y1shxwVLJkLiKY1NF9rxD9jOCnn3QmT78DUGBFC2JJekm+wvN/s0scSQ81G3tlZW26ftxb6CyChTze+ovpBAP7L+oZXuwVYasQS0kqPPQvSvn5T5f3wP3asQOxqq3SOnWUm9vXURxSeRQBVSSIzqqpnRvrY48L6mvc2n3nLJAc0Mom+YRY9IDOOxtpejc6sdd+9U8BAEKPCG6uFxXwYxle9kBUIiEB9mQgn0pAssOF/vXngP1R7XCPrRauaCQ2IKbdXCYfny1csc9ajUHVJrOszww1VjYzTuEVzWhW9kMTjZEgHARG0/S/FusgJfHRY6zT+smfvhFUzigh1o4s1AtC1lKYjX90CkbbACkBhlt/7n/yai4OKw+Mj01rx+1n2MZml7HIcbj67BybXS3SXHXq9LW7oRnyXnnVLq9N2c46wTFeCuV/WADeyPVO7vsRmkxn+4dbqwED1AjRkXTuDvAi0paLQbyII7H0ghyHAARY25GW+TUGXNE1+GBU5CUlbWA1d97BEdoW5bGOTzeO2E+Ktqt2/y4hmCe+uhqaBIIRr50HhieKIhDu/MlwypRbHDxno6VAgvh7wtIGsCLqHEEJQ==" -> "AgCV5tq4sISxnhu4gTB0V+hO06iOIXWY/93COj+V+F2rKjyUb8j6ktbsVibbGJ+KvHTo02UWJ5Qv9NtlZ7zFKm0HCrKKTORixKK3QTAJdk6pxIUYfHdGsDozcDU9ozF/2Xy3DuHEad20m1G1UCb9ICtkar07Q64jH/1P5L+xhA0RwdwW/zOQe5IxHV/2daf0oi4xJIaM0kLvhpe/PFIqViTm9fExpo5AlA5XqjrSNspoNfH6maX5OO9ShawyzKXEFMFLWJdtbV8JMh6nu/h3uVFKzWiH5rK3GbqVzNozZdjGzqA3iqPNZ5U7pBP5DX0qW65zuGLV28ZUWmZTTBpWed22FLn6+VLu3FDw7GSaXCIen0R3zr6WZ99SmBY/yBNJDphtJgrIWLX9W+VDGms9LOemXXToao4AxqBzdHCDu1kH+zV8BjFW8rKHCGsKcZhU3LxVVvf5Q0xUf6jhTqekVz1c58/ifmO/4QVm1uifPL3PBbdMYo1BzU8FZpieoPerzbw1TQR5yElTQY9Miphiht2vJhTXpIdIvvK3ByTaW6aZ1wACx6WSHj7hJrB5pLz6S2f7XeB0VwPeAtThwpovXRfrTr17sRmGGQ+M+LjHQbC3dZpq/JQWiNrZ8ufvBvJhyV1qUjf5ZTDQrsU0POdFqdwIkdtSbPOHdG2XaE0ODGNKy1TZb4aW73EX/LlXhzqpjA9/0mTyMMjJVkPkNij8by0Gr0VUVsv47+NtNHTV01VYNTAo/sO5JbYI3KBVw2K0kNemNHyKIwBn2lfzcCspeECUHL7/7jmt7o0Qg4WoKdRHFbzgEi0jW1Q9TPbkOMWPZj1gF2qTH5WK2NAeNDWtSvQBJyaoWkmsS7fpkzxs54OuYfUxtOdoyjadpLJDaar5WMkLWGGIf7XCY9zdSsRhIO0F90pRaOsfFelo6TRck9IhszQY20w6wj6T/YYTsslxJ8MJuhjmRyfEPSuJud6BtyYwyiFTV6kbwtxuBQbD09ocEPYhWOBEA74Hrki9X7g3hBaKT6m2wVKoa4fv0jXThp1sbYVq2xXKpA=="
                }
              ~ template      = {
                  ~ data     = null -> (known after apply)
                    # (2 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
    }

Plan: 1 to add, 14 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: apps-tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "apps-tfplan"

```
</details>